# Python Insights - Analisando Dados com Python

### Análise de dados do simulado semana 0 - CAAI

Analisando e manipulando dados do simulado da semana 0 do CAAI (Curso Assistencial Amigos de Itajubá) que tinha:
- 50 questões 
- 114 participantes

In [17]:
import pandas as pd

tabela = pd.read_excel("Simulado_Zero_.xls")
tabela = tabela.drop(columns=["Exam Set","Name","Total Marks","Grade","Exam","Not attempted","Assunto 1"])

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 10)

tabela = tabela.sort_values(by='Rank')

#display(tabela)

d:\Python\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning:

Workbook contains no default style, apply openpyxl's default

In [ ]:
# apenas para ver o quanto cada questão tem de erros e acertos
aux_int = 1
for coluna in tabela.columns:
    aux_obj = str(aux_int)
    if coluna == "Q " + aux_obj + " Marks":
        # quantidade bruta
        display(tabela["Q " + aux_obj + " Marks"].value_counts())
        # porcentagem
        #display(tabela["Q " + aux_obj + " Marks"].value_counts(normalize=True).map("{:.1%}".format))
        aux_int = aux_int + 1

In [22]:
# tabela para cada materia
professores = ['Willian', 'Luis', 'Charbel',
                 'Brenno', 'Gabriel', 'Lucas',
                 'Vinicius', 'Joao Chico', 'Davi']
tabelas = {}  # Criar um dicionário para armazenar os DataFrames
for c in professores:
    tabelas[c] = pd.DataFrame({'notas': [0.0, 1.0], 'Geral': 0})

aux_int = 1
for coluna in tabela.columns:
    aux_obj = str(aux_int)
    if coluna == "Q " + aux_obj + " Marks":
        if aux_int > 0 and aux_int < 6:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Willian']['Q' + aux_obj] = tabelas['Willian']['notas'].map(Geral)
            tabelas['Willian']['Geral'] = tabelas['Willian']['Geral'] + tabelas['Willian']['Q' + aux_obj]
        if aux_int > 5 and aux_int < 12:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Luis']['Q' + aux_obj] = tabelas['Luis']['notas'].map(Geral)
            tabelas['Luis']['Geral'] = tabelas['Luis']['Geral'] + tabelas['Luis']['Q' + aux_obj]
        if aux_int > 11 and aux_int < 17:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Charbel']['Q' + aux_obj] = tabelas['Luis']['notas'].map(Geral)
            tabelas['Charbel']['Geral'] = tabelas['Charbel']['Geral'] + tabelas['Charbel']['Q' + aux_obj]
        if aux_int > 16 and aux_int < 23:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Brenno']['Q' + aux_obj] = tabelas['Luis']['notas'].map(Geral)
            tabelas['Brenno']['Geral'] = tabelas['Brenno']['Geral'] + tabelas['Brenno']['Q' + aux_obj]
        if aux_int > 22 and aux_int < 29:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Gabriel']['Q' + aux_obj] = tabelas['Luis']['notas'].map(Geral)
            tabelas['Gabriel']['Geral'] = tabelas['Gabriel']['Geral'] + tabelas['Gabriel']['Q' + aux_obj]
        if aux_int > 28 and aux_int < 35:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Lucas']['Q' + aux_obj] = tabelas['Luis']['notas'].map(Geral)
            tabelas['Lucas']['Geral'] = tabelas['Lucas']['Geral'] + tabelas['Lucas']['Q' + aux_obj]
        if aux_int > 34 and aux_int < 40:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Vinicius']['Q' + aux_obj] = tabelas['Luis']['notas'].map(Geral)
            tabelas['Vinicius']['Geral'] = tabelas['Vinicius']['Geral'] + tabelas['Vinicius']['Q' + aux_obj]
        if aux_int > 39 and aux_int < 45:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Joao Chico']['Q' + aux_obj] = tabelas['Luis']['notas'].map(Geral)
            tabelas['Joao Chico']['Geral'] = tabelas['Joao Chico']['Geral'] + tabelas['Joao Chico']['Q' + aux_obj]
        if aux_int > 44 and aux_int < 51:
            Geral = tabela["Q " + aux_obj + " Marks"].value_counts()
            tabelas['Davi']['Q' + aux_obj] = tabelas['Luis']['notas'].map(Geral)
            tabelas['Davi']['Geral'] = tabelas['Davi']['Geral'] + tabelas['Davi']['Q' + aux_obj]
        aux_int = aux_int + 1

   notas  Geral  Q1  Q2  Q3  Q4  Q5
0    0.0    299  33  70  58  67  71
1    1.0    271  81  44  56  47  43

   notas  Geral  Q6  Q7  Q8  Q9  Q10  Q11
0    0.0    366  38  33  99  77   80   39
1    1.0    318  76  81  15  37   34   75

   notas  Geral  Q12  Q13  Q14  Q15  Q16
0    0.0    412  101  101   36   76   98
1    1.0    158   13   13   78   38   16

   notas  Geral  Q17  Q18  Q19  Q20  Q21  Q22
0    0.0    327   32   84   56   26   62   67
1    1.0    357   82   30   58   88   52   47

   notas  Geral  Q23  Q24  Q25  Q26  Q27  Q28
0    0.0    452   68   80   60   61  108   75
1    1.0    232   46   34   54   53    6   39

   notas  Geral  Q29  Q30  Q31  Q32  Q33  Q34
0    0.0    442   91   74   94   78   91   14
1    1.0    242   23   40   20   36   23  100

   notas  Geral  Q35  Q36  Q37  Q38  Q39
0    0.0    287   60   61   30   80   56
1    1.0    283   54   53   84   34   58

   notas  Geral  Q40  Q41  Q42  Q43  Q44
0    0.0    363   29   91  113  110   20
1    1.0    207   85   23    1    4   94

   notas  Geral  Q45  Q46  Q47  Q48  Q49  Q50
0    0.0    399   40   21   90   73   94   81
1    1.0    285   74   93   24   41   20   33

In [23]:
import plotly.express as px
from dash import Dash, dcc, html, Input, Output

app = Dash(__name__)

app.layout = html.Div([
    html.H4('Professor Willian'),
    dcc.Graph(id="graph"),
    html.P("Questão:"),
    dcc.Dropdown(id='questoes',
        options=['Q1', 'Q2', 'Q3', 'Q4', 'Q5', 'Geral'],
        value='Geral', clearable=False
    ),
])


@app.callback(
    Output("graph", "figure"), 
    Input("questoes", "value"))
def generate_chart(questoes):
    fig = px.pie(tabelas['Willian'], values=questoes, names="notas", hole=.3)
    return fig


app.run_server(debug=True)